{
  "backend/main.mo": "Motoko canister defining organizations, vendors, pricing plans, activity logs, user profiles, and interop context with owner/admin/user role detection and access-control checks.",
  "feature_evidence.json": "Feature evidence report mapping two interop test‑suite features to documentation files, components, and requirement IDs.",
  "frontend-file-summaries.txt": "Human‑written summaries for multiple frontend project files including micro‑apps, hooks, docs, and UI components.",
  "frontend/docs/shared-interop-test-suite-outline.md": "Outline describing test coverage for interop APIs with isolation, contract, multi‑tenant, workflow, and failure‑case scenarios.",
  "frontend/index.css": "Tailwind base styles plus OKLCH color variables for light and dark themes used across the frontend.",
  "frontend/index.html": "HTML entry point loading the root React container and main bundle.",
  "frontend/src/App.tsx": "App router setup mapping portal pages and micro‑apps into a TanStack Router tree wrapped with theme provider and toaster.",
  "frontend/src/catalog/microAppsCatalog.ts": "Typed catalog defining categories and metadata for all micro‑apps displayed in the portal.",
  "frontend/src/components/CategoryBadge.tsx": "Small badge component showing a micro‑app’s category with themed colors and icon.",
  "frontend/src/components/LanguageSelector.tsx": "Language selector dropdown using the i18n system to switch locales.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button integrating Internet Identity auth and clearing React Query cache on sign‑out.",
  "frontend/src/components/MicroAppCard.tsx": "Clickable card component that displays a micro‑app’s icon, name, category, and description and navigates to its detail page.",
  "frontend/src/components/OrgSwitcher.tsx": "Dropdown control for selecting or clearing the active organization, updating the user profile and showing toast notifications.",
  "frontend/src/components/PortalLayout.tsx": "Main layout with header navigation, authentication-aware menus, mobile menu handling, and optional profile setup prompt.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting new users to enter name and email, saving the profile via mutation with validation and toasts.",
  "frontend/src/components/RequireRole.tsx": "Wrapper enforcing authentication and role-based access, showing descriptive alerts when access is denied.",
  "frontend/src/hooks/useActor.ts": "Hook creating and managing the backend actor based on identity, initializing access control and invalidating dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for Internet Identity authentication, managing login, logout, stored identities, and status flags.",
  "frontend/src/hooks/useInteropContext.ts": "Hooks to fetch interop context (profile, org, role) and log activity with active-org awareness using backend actor.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, organizations, roles, admin status, and other backend data via an actor.",
  "frontend/src/i18n/index.ts": "Sets up a Zustand‑based i18n store with persistence and utilities for translating keys using English and Spanish dictionaries.",
  "frontend/src/i18n/locales/en.ts": "Provides the English translation dictionary for UI strings across navigation, pages, and common components.",
  "frontend/src/i18n/locales/es.ts": "Provides the Spanish translation dictionary mirroring the English keys for full UI localization.",
  "frontend/src/index.css": "Defines Tailwind base layers and custom CSS variables for light/dark themes and shared UI styles.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it in React Query and Internet Identity providers.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Renders an admin dashboard showing metrics and recent activity, gated by admin permissions and translated UI text.",
  "frontend/src/pages/MicroAppDirectoryPage.tsx": "Implements a searchable, filterable directory of micro‑apps grouped by category with translated UI labels.",
  "frontend/src/pages/microapps/AiPromptPlaygroundShell.tsx": "Mock AI prompt playground showing prompt/response history and accepting new prompts.",
  "frontend/src/pages/microapps/DaoProposalsShell.tsx": "Static DAO proposals viewer with mock proposals and basic vote UI.",
  "frontend/src/pages/microapps/ForumShell.tsx": "Displays a mock community forum with topic cards, author info, and navigation back to the directory.",
  "frontend/src/pages/microapps/MarketplaceShell.tsx": "Shows a vendor marketplace using user profile and vendor queries, with conditional states for loading, missing org, or empty vendor list.",
  "frontend/src/pages/microapps/MessagingInboxShell.tsx": "Renders a mock messaging inbox with conversation list and placeholder message panel while logging activity on load.",
  "frontend/src/pages/microapps/MicroAppShellPage.tsx": "Loads a micro‑app by slug and displays themed metadata with a placeholder card if the app exists or an error message if not.",
  "frontend/src/pages/microapps/SocialFeedShell.tsx": "Displays a mock social feed of posts and logs app‑open activity using user identity.",
  "frontend/src/pages/OrganizationManagementPage.tsx": "Page for listing, creating, and joining organizations using dialogs and query hooks.",
  "frontend/src/pages/PortalHomePage.tsx": "Landing page with hero section, feature highlights, and links to the directory.",
  "frontend/src/pages/PricingPlansPage.tsx": "Displays published pricing plans and allows admins to create new plans via a dialog.",
  "frontend/src/pages/VendorManagementPage.tsx": "Lists vendors for the active organization and allows authorized users to create or deactivate vendors.",
  "frontend/src/theme/categoryTheme.ts": "Defines color and icon themes for micro‑app categories and exports a helper to retrieve them.",
  "frontend/src/theme/tokens.ts": "Exports design tokens for colors, typography, spacing, radii, and shadows for consistent UI styling.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, persisting, and clearing URL parameters using both query strings and hash routing with sessionStorage fallback.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration enabling dark mode, custom theme extensions, color tokens, animations, and plugins like typography and container queries.",
  "project_state.json": "Project state file defining portal goals, architecture notes, and a list of existing feature requirements for a multi-tenant ICP-based micro‑app platform."
}