{
  "backend/main.mo": "Main backend actor implementing multi-tenant organization management, vendor management, pricing plans, activity logging, user profiles, and micro-app data stores (social posts, messaging conversations, forum topics) with role-based access control and interoperability context APIs.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "Aggregated summaries of frontend files including micro-app shells, hooks for backend integration, access control components, test suite documentation, and configuration files for the Arkly Portal multi-tenant application.",
  "frontend/docs/access-model-overview.md": "Documentation explaining Internet Identity authentication flow, shared interoperability layer with getInteropContext API, role-based access control, and multi-tenant organization boundaries for micro-apps.",
  "frontend/docs/caffeineai-replica-apps.md": "Catalog of CaffeineAI micro-apps adapted for Arkly Portal including Social Feed, Messaging Inbox, and Community Forum with integration details, adaptation complexity assessments, and backend API references.",
  "frontend/docs/shared-interop-test-suite-outline.md": "Comprehensive test suite outline for shared interoperability layer covering isolation tests, contract validation, multi-tenant boundaries, workflow chains, and failure conditions with detailed test scenarios.",
  "frontend/index.css": "Global CSS with Tailwind directives defining OKLCH color system variables for light and dark themes using coral/orange primary palette with sidebar, chart, and semantic color tokens.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx for the Website Of Integrated Micro-apps.",
  "frontend/src/__tests__/interop-contract.test.ts": "Tests the API shape and type validation of getInteropContext and getUserRole methods, ensuring InteropContext structure, UserProfile fields, optional field handling, and UserRole enum values are correct.",
  "frontend/src/__tests__/interop-isolation.test.ts": "Tests authentication state boundaries and isolation, verifying that getInteropContext returns appropriate data based on profile/org presence, getUserRole enforces membership checks, and logActivity requires authentication and membership.",
  "frontend/src/__tests__/interop-multitenant.test.ts": "Tests multi-tenant data isolation boundaries, ensuring users can only access data for organizations they belong to, cross-tenant access is prevented, and organization switching is correctly reflected in context.",
  "frontend/src/__tests__/README.md": "Test suite documentation with setup instructions, quick start commands, test execution options, coverage goals, CI integration details, and note that test files are excluded due to read-only package.json constraints.",
  "frontend/src/__tests__/setup.ts": "Provides test utilities including createMockActor factory for mocking backend actor methods, test fixtures for user profiles and contexts, and helper functions for generating mock principals.",
  "frontend/src/__tests__/vitest.d.ts": "Provides minimal TypeScript type declarations for vitest testing framework to enable compilation when vitest is not installed.",
  "frontend/src/App.tsx": "Main application component configuring TanStack Router with routes for portal pages (home, directory, organizations, dashboard, vendors, pricing) and micro-app shells (social feed, messaging, DAO, forum, marketplace, AI playground) wrapped in ThemeProvider and PortalLayout.",
  "frontend/src/catalog/microAppsCatalog.ts": "Defines the micro-app catalog with categories (AI, banking, payments, DAO, messaging, forums, social, etc.), app metadata, and utility functions for retrieving apps by slug and category colors.",
  "frontend/src/components/CategoryBadge.tsx": "Renders a styled badge component displaying a category icon and label with theme-based colors from the category theme system.",
  "frontend/src/components/LanguageSelector.tsx": "Provides a dropdown menu for selecting UI language (English/Spanish) using i18n translation system and shadcn/ui components.",
  "frontend/src/components/LoginButton.tsx": "A button component that handles Internet Identity authentication, displaying login/logout states with icons and managing authentication errors including retry logic for already-authenticated users.",
  "frontend/src/components/MicroAppCard.tsx": "A clickable card component that displays a micro-app with its icon, name, category badge, and description, featuring hover effects styled with category-specific colors.",
  "frontend/src/components/OrgSwitcher.tsx": "A dropdown menu component that allows users to switch between organizations or clear their active organization selection, updating the user profile accordingly.",
  "frontend/src/components/PortalLayout.tsx": "The main layout component providing a sticky header with navigation, authentication controls, organization switcher, language selector, and responsive mobile menu. Content appears truncated in the provided source.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog that prompts new users to set up their profile by entering a required name and optional email, preventing dismissal until completed.",
  "frontend/src/components/RequireRole.tsx": "A role-based access control component that restricts content based on authentication status and user roles (admin/owner), displaying appropriate error messages when access is denied.",
  "frontend/src/hooks/useActor.ts": "A React Query hook that creates and manages the backend actor instance based on authentication state, initializing access control with an admin token and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient configuration with idle handling options. Content appears truncated in the provided source.",
  "frontend/src/hooks/useInteropContext.ts": "Provides hooks to fetch the interoperability context (user profile, active org, role) and log activity events using the active organization context from the backend.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, organizations, vendors, pricing plans, activity logs, social posts, messages, and forum replies from the backend actor.",
  "frontend/src/i18n/index.ts": "Provides i18n infrastructure using Zustand for locale state management (en/es), with translation functions and persistent locale storage.",
  "frontend/src/i18n/locales/en.ts": "English translation strings for navigation, pages (home, directory, organizations, dashboard, vendors, pricing), common UI elements, profile, and footer.",
  "frontend/src/i18n/locales/es.ts": "Spanish translation strings mirroring the English locale structure for all UI text across the application.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes using a warm coral/orange color palette for primary colors.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page displaying metrics cards (organizations, vendors, plans, activities) and a table of recent activity logs, with admin role requirement.",
  "frontend/src/pages/MicroAppDirectoryPage.tsx": "Directory page for browsing micro-apps with search functionality, category filtering, and grouped display of apps by category.",
  "frontend/src/pages/microapps/AiPromptPlaygroundShell.tsx": "AI prompt playground micro-app with textarea input and mock response display, showing conversation history in card format.",
  "frontend/src/pages/microapps/DaoProposalsShell.tsx": "DAO proposals micro-app displaying mock governance proposals with vote counts, progress bars, and voting buttons for active proposals.",
  "frontend/src/pages/microapps/ForumShell.tsx": "Forum micro-app shell that displays topics for the active organization, allows owner/admin users to create new topics, and logs activity when opened.",
  "frontend/src/pages/microapps/MarketplaceShell.tsx": "Marketplace micro-app shell that displays active vendors for the user's active organization with basic vendor cards showing name, description, and contact info.",
  "frontend/src/pages/microapps/MessagingInboxShell.tsx": "Messaging micro-app shell that displays conversations for the active organization, allows users to select conversations and send messages, and logs activity when opened.",
  "frontend/src/pages/microapps/MicroAppShellPage.tsx": "Generic micro-app shell page that loads an app by slug from the catalog, displays its themed header with icon and description, and shows a placeholder for future functionality.",
  "frontend/src/pages/microapps/SocialFeedShell.tsx": "Social feed micro-app shell that displays posts for the active organization, allows authenticated users to create new posts, and logs activity when opened.",
  "frontend/src/pages/OrganizationManagementPage.tsx": "Organization management page with dialogs to create new organizations and join existing ones by ID, displaying a list of organizations with member counts and creation dates.",
  "frontend/src/pages/PortalHomePage.tsx": "Landing page with hero section, three feature cards (decentralized, integrated, secure), and call-to-action buttons linking to the directory.",
  "frontend/src/pages/PricingPlansPage.tsx": "Pricing plans page displaying published plans with features and prices; includes admin-only dialog to create new plans with name, description, price, category, and features.",
  "frontend/src/pages/VendorManagementPage.tsx": "Vendor management page for organization owners/admins to create and deactivate vendors, displaying vendor cards with contact info and status badges.",
  "frontend/src/theme/categoryTheme.ts": "Defines color and icon mappings for each micro-app category (ai, banking, payments, dao, network, messaging, forums, social, marketplace, analytics, events, knowledge, forms, files, support).",
  "frontend/src/theme/tokens.ts": "Design token definitions for the Arkly Portal including colors (warm coral/orange primary), typography scales, spacing, border radii, and shadow values.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and managing URL parameters from both query strings and hash-based routing, with sessionStorage integration for parameter persistence across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color system using OKLCH color space, container settings, border radius variables, animations, and plugins for typography, container queries, and animations.",
  "frontend/vitest.config.ts": "Vitest test configuration with happy-dom environment, coverage thresholds set at 70%, and path alias setup for '@' pointing to './src'.",
  "project_state.json": "Project state document describing an ICP-based portal hub with modular micro-apps, multi-tenant architecture, RBAC permissions, multilingual support, and a directory of categorized micro-app features including AI, banking, DAOs, messaging, and social media."
}