{
  "kind": "build_request",
  "title": "Compact test suite outline for shared interoperability layer",
  "projectName": "Arkly Portal",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-18",
      "text": "Add a compact test suite outline document for the shared interoperability layer that enumerates backend canister API tests for getInteropContext, getUserRole, and logActivity, including isolation tests, contract/shape assertions, multi-tenant boundary tests, workflow-chain tests, and failure-condition tests.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Yes please generate a compact test suite outline"
        ]
      },
      "acceptanceCriteria": [
        "A new markdown document exists in the repo that is clearly titled as the shared interoperability layer test suite outline.",
        "The outline includes explicit test cases for getInteropContext covering: no profile, profile with no active org, profile with active org, and role resolution (owner/admin/user/null).",
        "The outline includes explicit test cases for logActivity covering: orgId=0 logging, orgId=activeOrg logging, and unauthorized logging when caller is not an org member for orgId!=0.",
        "The outline includes explicit multi-tenant boundary tests (e.g., user in Org A cannot obtain member/role context for Org B and cannot log activity to Org B).",
        "The outline includes explicit workflow-chain scenarios (create org → join org → set active org in profile → getInteropContext → logActivity) with expected state transitions and assertions.",
        "The outline includes explicit failure-condition tests that expect traps/denials for unauthorized profile access, unauthorized org access, unauthorized role checks, and unauthorized admin-only endpoints where applicable."
      ]
    },
    {
      "id": "REQ-19",
      "text": "Include in the test suite outline a minimal, repeatable manual test execution plan using multiple identities (e.g., separate local identities for owner/admin/user) to exercise the interoperability APIs end-to-end, with concrete steps and expected outcomes.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Yes please generate a compact test suite outline"
        ]
      },
      "acceptanceCriteria": [
        "The document describes how to run the outlined scenarios locally with at least two distinct callers to validate role changes and org-boundary behavior.",
        "The document specifies the required preconditions and the expected outputs/observations for each manual test scenario (e.g., expected InteropContext fields, expected authorization failures).",
        "The manual plan references the exact backend methods used in this project (getInteropContext, saveCallerUserProfile, createOrganization, joinOrganization, getUserRole, logActivity) and does not refer to non-existent endpoints."
      ]
    }
  ],
  "constraints": [
    "Respect the single-actor Motoko backend architecture; keep all Motoko logic in backend/main.mo if any code changes are needed.",
    "Do not edit any frontend files under frontend/src/components/ui or other immutable paths listed in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Implementing a full automated test harness/CI pipeline for these tests.",
    "Adding third-party testing services or external databases.",
    "Building full end-to-end browser automation tests."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}