{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Shared interoperability layer: compact test suite outline (frontend-only doc)",
  "requirements": [
    {
      "id": "REQ-18",
      "summary": "Create a compact markdown test suite outline for shared interoperability layer APIs (getInteropContext, getUserRole, logActivity) covering isolation, contracts, multi-tenant boundaries, workflow chains, and failure conditions.",
      "acceptanceCriteria": [
        "A new markdown document exists in the repo that is clearly titled as the shared interoperability layer test suite outline.",
        "The outline includes explicit test cases for getInteropContext covering: no profile, profile with no active org, profile with active org, and role resolution (owner/admin/user/null).",
        "The outline includes explicit test cases for logActivity covering: orgId=0 logging, orgId=activeOrg logging, and unauthorized logging when caller is not an org member for orgId!=0.",
        "The outline includes explicit multi-tenant boundary tests (e.g., user in Org A cannot obtain member/role context for Org B and cannot log activity to Org B).",
        "The outline includes explicit workflow-chain scenarios (create org → join org → set active org in profile → getInteropContext → logActivity) with expected state transitions and assertions.",
        "The outline includes explicit failure-condition tests that expect traps/denials for unauthorized profile access, unauthorized org access, unauthorized role checks, and unauthorized admin-only endpoints where applicable."
      ],
      "file_operations": [
        {
          "path": "frontend/docs/shared-interop-test-suite-outline.md",
          "operation": "create",
          "description": "Add a compact, clearly-titled test suite outline document for the shared interoperability layer, enumerating backend canister API test cases for getInteropContext, getUserRole, and logActivity, including: isolation tests, contract/shape assertions for returned InteropContext and roles, explicit multi-tenant boundary tests between orgs, workflow-chain scenarios with expected state transitions, and failure-condition tests expecting traps/denials where applicable. Ensure the cases explicitly cover the required getInteropContext and logActivity scenarios from the acceptance criteria."
        }
      ]
    },
    {
      "id": "REQ-19",
      "summary": "Extend the test suite outline with a minimal, repeatable manual execution plan using multiple identities to exercise interoperability APIs end-to-end with steps and expected outcomes.",
      "acceptanceCriteria": [
        "The document describes how to run the outlined scenarios locally with at least two distinct callers to validate role changes and org-boundary behavior.",
        "The document specifies the required preconditions and the expected outputs/observations for each manual test scenario (e.g., expected InteropContext fields, expected authorization failures).",
        "The manual plan references the exact backend methods used in this project (getInteropContext, saveCallerUserProfile, createOrganization, joinOrganization, getUserRole, logActivity) and does not refer to non-existent endpoints."
      ],
      "file_operations": [
        {
          "path": "frontend/docs/shared-interop-test-suite-outline.md",
          "operation": "modify",
          "description": "Add a dedicated 'Manual execution plan (repeatable)' section describing a minimal local, multi-identity walkthrough (at least two callers such as owner/admin/user identities) with concrete preconditions, step sequences, and expected observations. The manual plan must explicitly reference only these backend methods: getInteropContext, saveCallerUserProfile, createOrganization, joinOrganization, getUserRole, logActivity; and must include expected authorization failures for org-boundary and unauthorized actions."
        }
      ]
    }
  ]
}